src/test/resources/responses/charge/charge-create-with-three-ds-provided.json

{
  "id": "11efdfaf-1e1d-899c-9c99-8718c995d6c0",
  "store_id": "11e75262-8c6a-60c4-9d8f-efa3568a7fa6",
  "transaction_token_id": "11efdfad-91d5-3954-91f5-73fd10072929",
  "transaction_token_type": "recurring",
  "subscription_id": null,
  "merchant_transaction_id": null,
  "requested_amount": 100,
  "requested_currency": "JPY",
  "requested_amount_formatted": 100,
  "charged_amount": null,
  "charged_currency": null,
  "charged_amount_formatted": null,
  "fee_amount": null,
  "fee_currency": null,
  "fee_amount_formatted": null,
  "only_direct_currency": false,
  "capture_at": null,
  "descriptor": null,
  "descriptor_phone_number": null,
  "status": "pending",
  "error": null,
  "metadata": {},
  "mode": "test",
  "created_on": "2025-01-31T08:41:08.925809Z",
  "redirect": {},
  "three_ds": {
    "mode": "provided"
  },
  "platform_id": "11e73ea1-d72c-8ce2-996d-4bb6671eb667",
  "merchant_id": "11e75262-6cfe-e5ac-ad8c-0f520f83eceb",
  "ledger_id": null,
  "client_metadata_id": "11efdfaf-1e1c-cf27-942d-578966d41da7",
  "updated_on": "2025-01-31T08:41:08.925809Z",
  "type": "normal"
}